InformationRegisters/PushПользователиID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>PushПользователиID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PushId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/PushПользователиID/Ext/ManagerModule.bsl
Функция ПолучитьPushID(Пользователь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	PushПользователиID.PushId КАК PushId
	|ИЗ
	|	РегистрСведений.PushПользователиID КАК PushПользователиID
	|ГДЕ
	|	PushПользователиID.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат БюджетныйНаСервере.ДеСериализоватьОбъект(Выборка.PushId);		
	КонецЦикла;

КонецФункции

Процедура УстановитьPushID(Пользователь, ID) Экспорт
	НоваяЗапись = РегистрыСведений.PushПользователиID.СоздатьМенеджерЗаписи();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.PushId = БюджетныйНаСервере.СериализоватьОбъект(ID);
	НоваяЗапись.Записать();
	

КонецПроцедуры
